#include <stdio.h> // 코드를 작성할 때 표준 입출력 헤더
// c언어로 콘솔창에 글자를 출력하게 하려면 어떤 헤더를 추가해야하나요?

void Example()
{
    pr
}



int main()



{
    printf("3강 시작!\n");

    int num1;   // 정수형 데이터를 저장하는 num1 변수를 선언
    num1 = 10;  // num1 저장 공간에 10이라는 숫자를 저장하겠다.
    
    int num2 = num1 * 1 + 10;

    num1 = num2;

    printf("num1의 값 : %d\n", num1);

    //////// 정수
    // 자료형 - 메모리의 크기가 얼마나 되는가 + 자료의 정보가 무엇인가
    // char : - 128 ~ 127 

    int num3 = 200;
    char charMaxValue = 127;
    char num4 = 200;
    short num5 = 200;
    long num6 = 200;
    long long num7 = 200;

   // printf("num3의 값 : %d\n", num3);
   // printf("num4의 값 : %d", num4);

   // 리그 오브 레전드 공식.
   // 이차 함수를 공식으로 사용하는 하나의 예제
   // 게임에서 사용 할 수 있는 예제 고민
   
    // 경험치 :
    // 미니언 처치 " 경험치 획득 일정.
    // 레벨   : 레벨이 높을수록 경험치를 적게 획득 시켜야 한다.

    // 미니언 경험치를 시간이 지날 수록 적게 주게 할까?
    // -> 챔피언을 죽였는데도 경험치를 조죠. 게임의 성질.
    
    // 경험치를 갈 수록 크게 획득해야 하면 경험치 요구량을 크게 하게 하자
    // 어떤 방식으로 크게 할까요?  공식으로 게임을 만들면 공식을 사용하여 쉽게 값을 계산 
    // 1레벨 10 2레벨 30 3레벨 60 4레벨 ....     / MagicNumber

    // ste 1 ~ 10
    // Result
    // printf 


    // 유저의 피드백 10레벨이 밸런스가 이상함 <- 10레벨을 어떻게 처리해
    // 10레벨 Debug -> 무엇이 의도한 내용과 달랐는가?

    //디버깅의 장점 특정 지점을 특정하여 어디서 문제가 생겼는지 원인을 찾기 쉬워짐

}

